<modsCollection xmlns="http://www.loc.gov/mods/v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.loc.gov/mods/v3 http://www.loc.gov/standards/mods/v3/mods-3-2.xsd"><mods version="3.2" xmlns="http://www.loc.gov/mods/v3" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.loc.gov/mods/v3 http://www.loc.gov/standards/mods/v3/mods-3-2.xsd"><genre authority="diva" type="publicationTypeCode">studentThesis</genre><genre authority="diva" lang="swe" type="publicationType">Studentuppsats (Examensarbete)</genre><genre authority="diva" lang="eng" type="publicationType">Student thesis</genre><genre authority="diva" lang="nor" type="publicationType">Oppgave</genre><name type="personal"><namePart type="family">Maguire Jr</namePart><namePart type="given">Gerald Q</namePart><namePart type="termsOfAddress">PROFESSOR</namePart><role><roleTerm authority="marcrelator" type="code">ths</roleTerm></role><affiliation>RADIO SYSTEMS LAB</affiliation><role /></name><name type="personal"><namePart type="family">V&#228;stberg</namePart><namePart type="given">Anders</namePart><namePart type="termsOfAddress">ASSOCIATE PROFESSOR</namePart><role><roleTerm authority="marcrelator" type="code">ths</roleTerm></role></name><name><namePart>KTH</namePart><namePart> EECS</namePart><namePart> CoS</namePart><namePart> RSlab</namePart><role><roleTerm authority="marcrelator" type="code">pbl</roleTerm></role></name><titleInfo  lang=""><title>Connecting Silos</title><subTitle>Automation System for Thesis Processing in Canvas and Diva</subTitle></titleInfo ><subject  lang="eng"><topic>RESTful APIs</topic><topic> Canvas</topic><topic> DiVA</topic><topic> Calendars</topic><topic> data mining</topic></subject ><abstract  lang="eng">Write an abstract with the following components: &#8226; What is the topic area? (optional) Introduces the subject area for the project. &#8226; Short problem statement &#8226; Why was this problem worth a Master&#8217;s thesis project? (i.e., why is the problem both significant and of a suitable degree of difficulty for a Master&#8217;s thesis project? Why has no one else solved it yet?) &#8226; How did you solve the problem? What was your method/insight? &#8226; Results/Conclusions/Consequences/Impact: What are your key results/conclusions? What will others do based upon your results? What can be done now that you have finished - that could not be done before your thesis project was completed? As the era of digitalization dawns, the need to integrate separate silos into a synchronized connected system is becoming of ever greater significance. This thesis focuses on the Canvas Learning Management System (LMS) and the Digitala vetenskapliga arkive (DiVA) as examples of separate silos. The thesis presents several methods of automating document handling associated with a degree project. It exploits the fact that students will submit their thesis to their examiner via Canvas. Canvas is the LMS platform used by students to submit all their coursework. When the examiner approves the thesis it will be archived in DiVA and optionally published via DiVA. DiVA is an institutional repository used for research publications and student theses. When manually archiving and publishing student theses via DiVA several fields need to be filled in. These fields is provide meta data for the thesis itself. The content of these fields (author, title, keywords, abstract, &#8230;) can be used when searching via the DiVA portal. While it might not seem like a massive task to enter this meta data for an individual thesis; however, given the number of theses that are submitted every year, this process takes a significant amount of time and effort. Moreover, it is important to enter this data correctly &#8211; which is difficult when manually doing this task. Therefore, this thesis project seeks to automate this process for future theses. The solution that presented in this thesis will parse PDF documents and use other information from the LMS in order to automatically generate a cover for the thesis and fill in the required DiVA meta data. This data will also be inserted into a calendar system to provide an announcement for the student&#8217;s thesis presentation. Moreover, the data will be checked for correctness and consistency. Manually filling in DiVA fields in order to publish theses has been a quite demanding and time-consuming process. Thus, there is often a delay before a thesis is published via DiVA. Therefore, this thesis project&#8217;s goal is to provide KTH with an automated means to handle thesis archiving and publication via DiVA, while doing so faster, more efficiently, and with fewer errors. Keywords 5-6 keywords</abstract ><abstract lang="swe">Eftersom den digitaliserade eran f&#246;rb&#228;ttras, blir behovet av att integrera separata silor i ett synkroniserat anslutet system allt viktigare. Denna thesis kommer att fokusera p&#229; Canvas Learning Management System och Digitala vetenskapliga arkive (DiVA) Portal som de separata silorna. Under hela denna thesisrapporten presenteras metoder f&#246;r att automatisera Canvas betr&#228;ffande publicering av inl&#228;mnad thesis till. Canvas &#228;r f&#246;r n&#228;rvarande den plattform som anv&#228;nds av Kungliga Tekniska h&#246;gskolan (KTH) d&#228;r studenter l&#228;mnar in allt sitt kursarbete fr&#229;n sm&#229; volymer till stora volymer som t.ex. thesisrapporter. DiVA &#228;r en institutionell f&#246;rvaringsplats som anv&#228;nds f&#246;r thesisrapporter. D&#228;rf&#246;r m&#229;ste flera f&#228;lt fyllas i n&#228;r man publicerar thesisrapporter fr&#229;n Canvas till DiVA manuellt. Att fylla i DiVA-f&#228;lt f&#246;r att publicera thesisrapporter kanske inte verka som en stor uppgift om det bara fanns n&#229;gra f&#229; antal thesisrapporter. Men med tanke p&#229; det stora antalet thesisrapporter som varje &#229;r skickas till Canvas, kommer denna process att ta en betydande tid och mankraft som inte ska underskattas. D&#228;rf&#246;r kommer detta bachelorsprojekt att fokusera p&#229; att ta itu med detta problem f&#246;r framtida dessa inl&#228;gg. L&#246;sningen som presenteras i hela denna rapport kommer att best&#229; av metoder f&#246;r att analysera Portable Document Format (PDF) -dokument och skapa ett omslag med hj&#228;lp av den analyserade informationen och fylla i de &#246;nskade DiVA-f&#228;lten automatiskt. Dessa data kommer ocks&#229; att inf&#246;ras i ett kalendersystem och kommer att kontrolleras b&#229;de automatiskt och manuellt, f&#246;r korrekthet och konsistens. Manuell fyllning av DiVA-f&#228;lt f&#246;r att publicera thesisrapporter har varit en ganska kr&#228;vande och tidsbesparande process f&#246;r KTH under de senaste &#229;ren, d&#228;r ingen automatisering f&#246;r denna process tillhandah&#246;lls. Detta har lett till att en upps&#228;ttning av thesisrapporter som v&#228;ntar p&#229; att publiceras p&#229; DiVA och inte tillr&#228;ckligt med tid f&#246;r att n&#229;gon anst&#228;lld tar ansvar f&#246;r att ta hand om problemet. D&#228;rf&#246;r kommer det h&#228;r projektet att kunna utrusta KTH:s personal med ett automatiskt publiceringssystem, vilket ger effektivitet till thesisrapporternas publikation i DiVA. Nyckelord 5-6 nyckelord</abstract><name><namePart type="family">BESHARAT</namePart><namePart type="given">Shiva</namePart><role><roleTerm authority="marcrelator" type="code">aut</roleTerm></role></name><name><namePart type="family">LI</namePart><namePart type="given">QI</namePart><role><roleTerm authority="marcrelator" type="code">aut</roleTerm></role></name></mods></modsCollection>